# PointLocationOnCurve Properties

---
The PointLocationOnCurve type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| MeasureFrom|  The location on the curve from which the measurement is taken.
| MeasurementType|  The measurement type.
| MeasurementValue|  The measurement value.
Top
#### Reference
PointLocationOnCurve Class
Autodesk.Revit.DB Namespace